Old_Grades_Letters = {
    0: ['А', 'Б'],
    1: ['А', 'Ә' ,'Б', 'В'],
    2: ['А', 'Ә' ,'Б', 'В'],
    3: ['А', 'Ә' ,'Б', 'В'],
    4: ['А', 'Ә' ,'Б', 'В', 'Г'],
    5: ['А', 'Ә' ,'Б', 'В', 'Г', 'Ғ'],
    6: ['А', 'Ә' ,'Б', 'В', 'Г', 'Ғ'],
    7: ['А', 'Ә' ,'Б', 'В'],
    8: ['А', 'Ә' ,'Б', 'В'],
    9: ['А', 'Ә' ,'Б', 'В'],
    10: ['А', 'Ә' ,'Б', 'В'],
    11: ['Б'] 
}

Grades_Letters = {
    0: ['А', 'Б'],
    1: ['А', 'Б'],
    2: ['А', 'Ә' ,'Б', 'В'],
    3: ['А', 'Ә' ,'Б', 'В'],
    4: ['А', 'Ә' ,'Б', 'В'],
    5: ['А', 'Ә' ,'Б', 'В', 'Г'],
    6: ['А', 'Ә' ,'Б', 'В', 'Г', 'Ғ'],
    7: ['А', 'Ә' ,'Б', 'В', 'Г', 'Ғ'],
    8: ['А', 'Ә' ,'Б', 'В'],
    9: ['А', 'Ә' ,'Б', 'В'],
    10: ['А', 'Ә' ,'Б', 'В'],
    11: ['А', 'Ә' ,'Б', 'В'],
}

Old_Grades_Letters_Lyc = {
    7: ['A', 'B' ,'C', 'D'],
    8: ['A', 'B'],
    9: ['A', 'B'],
    10: ['A', 'B'],
    11: ['A', 'B']
}

Grades_Letters_Lyc = {
    7: ['A', 'B' ,'C', 'D'],
    8: ['A', 'B' ,'C', 'D'],
    9: ['A', 'B'],
    10: ['A', 'B'],
    11: ['A', 'B'],
}


User_type_dict = {
    'Админ': 'Администрация',
    'Бух': 'Бухгалтер',
    'ВнСв': 'Зам по ВСиРШ',
    'Дело': 'Делопроизводитель',
    'Дир': 'Директор',
    'Кур': 'Куратор',
}

student_status = [
    ('Лид', 'В работе'),
    ('Int', 'Intermediate'), #System use only: Лид -> Акт
    ('Акт', 'Активный'),
    ('Int_leave', 'Intermediate leave'), #Systen use only: Акт -> Выб
    ('Арх', 'Архив'),
    ('Вып', 'Выпускник')
]

USER_TYPE_ADMIN = 'Админ'
USER_TYPE_VNSV = 'ВнСв'
USER_TYPE_HR = 'HR'
USER_TYPE_CURATOR = 'Кур'

USER_TYPE_CHOICES = [
    (USER_TYPE_ADMIN, 'Администрация'),
    (USER_TYPE_VNSV, 'Зам по ВСиРШ'),
    (USER_TYPE_CURATOR, 'Куратор'),
    (USER_TYPE_HR, 'Отдел Кадров'),
]