#Grade: 1, Class: 1A
Grades_models = [("0А", "0А класс"), ("0Б", "0Б класс"), ("1А", "1А класс"), ("1Ә", "1Ә класс"),
                 ("1Б", "1Б класс"), ("1В", "1В класс"), ("2А", "2А класс"), ("2Ә", "2Ә класс"),
                 ("2Б", "2Б класс"), ("2В", "2В класс"), ("3А", "3А класс"), ("3Ә", "3Ә класс"),
                 ("3Б", "3Б класс"), ("3В", "3В класс"), ("4А", "4А класс"), ("4Ә", "4Ә класс"),
                 ("4Б", "4Б класс"), ("4В", "4В класс"), ("4Г", "4Г класс"), ("5А", "5А класс"),
                 ("5Ә", "5Ә класс"), ("5Б", "5Б класс"), ("5В", "5В класс"), ("5Г", "5Г класс"),
                 ("5Ғ", "5Ғ класс"), ("6А", "6А класс"), ("6Ә", "6Ә класс"), ("6Б", "6Б класс"),
                 ("6В", "6В класс"), ("6Г", "6Г класс"), ("6Ғ", "6Ғ класс"), ("7А", "7А класс"),
                 ("7Ә", "7Ә класс"), ("7Б", "7Б класс"), ("7В", "7В класс"),
                 ("8А", "8А класс"), ("8Ә", "8Ә класс"), ("8Б", "8Б класс"), ("8В", "8В класс"),
                 ("9А", "9А класс"), ("9Ә", "9Ә класс"), ("9Б", "9Б класс"), ("9В", "9В класс"),
                 ("10А", "10А класс"), ("10Ә", "10Ә класс"), ("10Б", "10Б класс"), ("10В", "10В класс"),
                 ("11Б", "11Б класс"), ("-", "-"),
                 ("0", "0 класс"), ("1", "1 класс"), ("2", "2 класс"), ("3", "3 класс"), ("4", "4 класс"),
                 ("5", "5 класс"), ("6", "6 класс"), ("7", "7 класс"), ("8", "8 класс"), ("9", "9 класс"),
                 ("10", "10 класс"), ("11", "11 класс")]

Grades_Letters = {
    0: ['А', 'Б'],
    1: ['А', 'Ә' ,'Б', 'В'],
    2: ['А', 'Ә' ,'Б', 'В'],
    3: ['А', 'Ә' ,'Б', 'В'],
    4: ['А', 'Ә' ,'Б', 'В', 'Г'],
    5: ['А', 'Ә' ,'Б', 'В', 'Г', 'Ғ'],
    6: ['А', 'Ә' ,'Б', 'В', 'Г', 'Ғ'],
    7: ['А', 'Ә' ,'Б', 'В'],
    8: ['А', 'Ә' ,'Б', 'В'],
    9: ['А', 'Ә' ,'Б', 'В'],
    10: ['А', 'Ә' ,'Б', 'В'],
    11: ['Б']
}

Classes = ["Все классы", "0А класс", "0Б класс", "1А класс", "1Ә класс", "1Б класс", "1В класс",
          "2А класс", "2Ә класс", "2Б класс", "2В класс",
          "3А класс", "3Ә класс", "3Б класс", "3В класс",
          "4А класс", "4Ә класс", "4Б класс", "4В класс", "4Г класс",
          "5А класс", "5Ә класс", "5Б класс", "5В класс", "5Г класс", "5Ғ класс",
          "6А класс", "6Ә класс", "6Б класс", "6В класс", "6Г класс", "6Ғ класс",
          "7А класс", "7Ә класс", "7Б класс", "7В класс",
          "8А класс", "8Ә класс", "8Б класс", "8В класс",
          "9А класс", "9Ә класс", "9Б класс", "9В класс",
          "10А класс", "10Ә класс", "10Б класс", "10В класс",
          "11Б класс", "Лиды"]


User_type_dict = {
    'Админ': 'Администрация',
    'Бух': 'Бухгалтер',
    'ВнСв': 'Зам по ВСиРШ',
    'Дело': 'Делопроизводитель',
    'Дир': 'Директор',
    'Кур': 'Куратор',
}

student_status = [
    ('Лид', 'В работе'),
    ('Int', 'Intermediate'), #System use only: Лид -> Акт
    ('Акт', 'Активный'),
    ('Выб', 'Выбыл')
]