Positions = [
    "Учитель математики",
    "Учитель физики",
    "Учитель химии",
    "Учитель биологии",
    "Учитель информатики",
    "Учитель естествознания",
    
    "Учитель английского языка",
    "Учитель русского языка и литературы",
    "Учитель казахского языка и литературы",
    
    "Учитель истории",
    "Учитель географии",
    "Учитель музыки/ рисования/ трудового обучения",
    "Учитель физической культуры",
    "Учитель НВП",
    "Учитель основ права",
    
    "Учитель начальной школы",
    
    "Психолог",
    "Куратор/ Педагог-организатор",
    "Воспитатель в школьном интернате",
    "Тренер спортивной секции",
    "Руководитель кружка",
    "Делопроизводитель",
    "Администрация",
    "Бухгалтер",
    
    "Медицинская сестра",
    "Библиотекарь",
    "Специалист по информационным технологиям",
    "Сотрудник по уборке",
    "Кухонный работник",
    "Плотник/ строительный мастер",
    "Другое"
]


TimeOptions = ['10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00', '13:30', '14:00', '14:30', '15:00', '15:30', '16:00', '16:30', '17:00', '17:30']

USER_TYPE_HR = "HR"